{
  "success": true,
  "transcript": ". Hi, Nama saya hari ini, anda sedang menjakan isteri malam saya pada hari ini. So jom kita terima kasih pada hari ini. Apa yang menjauhkan saya? Apa yang membuatkan saya gembira. Apa yang membuatkan saya. Tua-tiba-banyak duit banyak tu? Semua-banyak duit rata, semua boleh kena kena kena kena kena kena kena buat apa? Sebab apa? So kalau ada duit benda-benda tu kan? So kalau ada duit apa-bawa apa? Nak buat apa? Okey, nak buat apa? Okey, nak buat apa? Okey, nak buat apa? Okey, nak buat apa? Okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, okey, oi, oi, okey, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi, oi So, sebab apa? Sebab apa? Aik itu? Aikapak apa? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Aik? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Aduhh? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau? Atau. Atau? Atau? Atau? Atau? Atau? Atau. Atau? Atau. Atau? Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. Atau. A. Atau kira lagi tu? Bila lagi tu? Kenapa-buala? Kenapa? Kenapa? Kenapa? Kenapa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Haa? Ha !",
  "confidence": 0.6876439929008484,
  "language": "ms",
  "service": "Mesolitica malaysian-distil-whisper-large-v3 (Smart Chunked)",
  "word_error_rate": 0.08,
  "model": "mesolitica/malaysian-distil-whisper-large-v3",
  "chunks_processed": 5,
  "total_chunks": 5,
  "chunking_method": "Smart VAD-based",
  "saved_at": "2025-09-21T00:02:25.327188",
  "audio_filename": "videoplayback.mp3",
  "word_count": 477,
  "character_count": 2608
}